СкладГП/src/Catalogs/Ячейки/Ячейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ячейки</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>НомерВСекторе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКартыСклада</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретПополнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГеоКоординаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимумРядов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Двухсторонний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЯчейкаОТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШтабеля</name>
    <type>
      <types>EnumRef.vlp_ВидыШтабелейСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Catalog>

СкладГП/src/Catalogs/Ячейки/Forms/ФормаВыбораСектора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ЗаполнитьСектор();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСектор()
	ЭлементыКнопкой = ИСТИНА;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ячейки.Ссылка КАК Ссылка,
	|	Ячейки.Наименование КАК Наименование,
	|	Ячейки.НомерВСекторе КАК НомерВСекторе,
	|	Ячейки.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Константа.Склад КАК КонстСклад
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Ячейки КАК Ячейки
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ячейки.Ссылка) КАК КоличествоШтабелей,
	|				Ячейки.Родитель КАК Родитель
	|			ИЗ
	|				Справочник.Ячейки КАК Ячейки
	|			ГДЕ
	|				НЕ Ячейки.ПометкаУдаления
	|			
	|			СГРУППИРОВАТЬ ПО
	|				Ячейки.Родитель) КАК ВложенныйЗапрос
	|			ПО Ячейки.Ссылка = ВложенныйЗапрос.Родитель
	|		ПО КонстСклад.Значение = Ячейки.Владелец
	|ГДЕ
	|	Ячейки.ЭтоГруппа
	|	И НЕ Ячейки.ПометкаУдаления
	|	И ЕСТЬNULL(ВложенныйЗапрос.КоличествоШтабелей, 0) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерВСекторе,
	|	Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ТаблицаСекторов.Добавить();
		СтрокаТаблицы.Ссылка = Выборка.Ссылка;
		
		Если ЭлементыКнопкой Тогда
			ЭлементФормы = ЯчейкиСклада.ЭлементФормыСекторШтабельКнопка(ЭтаФорма, Элементы, Неопределено, СтрокаТаблицы.Ссылка, НЕОПРЕДЕЛЕНО, СтрокаТаблицы);
		Иначе
			ЭлементФормы = ЯчейкиСклада.ЭлементФормыСекторШтабель(ЭтаФорма, Элементы, Неопределено, СтрокаТаблицы.Ссылка, НЕОПРЕДЕЛЕНО, СтрокаТаблицы);
		КонецЕсли;
			
		СтрокаТаблицы.ИмяЭлементаФормы = ЭлементФормы.Имя;
	КонецЦикла;
	
	Если ТаблицаСекторов.Количество() > 0 Тогда
		ПерваяКнопка = Элементы[ТаблицаСекторов[0].ИмяЭлементаФормы];
		ЭтаФорма.ТекущийЭлемент = ПерваяКнопка;
		ПерваяКнопка.АктивизироватьПоУмолчанию = ИСТИНА;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	ДанныеЭкрана = ПолучитьИнформациюЭкрановКлиента();
	Если ДанныеЭкрана[0].Ширина > ДанныеЭкрана[0].Высота Тогда
		ГоризонтальноеПоложениеЭкрана = Истина;
		ЭлементовПоГоризонтали = 6;
	Иначе
		ГоризонтальноеПоложениеЭкрана = Ложь;
		ЭлементовПоГоризонтали = 3;
	КонецЕсли;
	ШиринаЭкрана = ДанныеЭкрана[0].Ширина;
	НастроитьФорму();
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму(ЗаполнитьТаблицу = ЛОЖЬ)
	Если ЗаполнитьТаблицу Тогда
		ЗаполнитьСектор()
	КонецЕсли;
	ЯчейкиСклада.НастроитьФормуСектораШтабеляКвадратики(ЭтотОбъект, ТаблицаСекторов, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура СекторШтабельНажатие(Элемент, СтандартнаяОбработка)

	СтрокаОписания = ПолучитьСтрокуОписанияЭлементаФормыНаКлиенте(Элемент.Имя, ТаблицаСекторов);	
	
	ДействиеПослеВыбораШтабеля = Новый ОписаниеОповещения("ДействиеПослеВыбораШтабеля", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Ячейки.Форма.ФормаВыбораШтабеляСектора", Новый Структура("Сектор", СтрокаОписания.Ссылка), ЭтаФорма,,,,ДействиеПослеВыбораШтабеля, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СекторШтабельНажатиеКнопки(Команда)

	СтрокаОписания = ПолучитьСтрокуОписанияЭлементаФормыНаКлиенте(Команда.Имя, ТаблицаСекторов);	
	
	ДействиеПослеВыбораШтабеля = Новый ОписаниеОповещения("ДействиеПослеВыбораШтабеля", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Ячейки.Форма.ФормаВыбораШтабеляСектора", Новый Структура("Сектор", СтрокаОписания.Ссылка), ЭтаФорма,,,,ДействиеПослеВыбораШтабеля, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуОписанияЭлементаФормыНаКлиенте(ИмяЭлемента, ТаблицаОписания)
	СтрПакета = ТаблицаОписания.НайтиСтроки(Новый Структура("ИмяЭлементаФормы", ИмяЭлемента));
	Если СтрПакета.Количество() = 0 Тогда 
		Возврат Неопределено
	КонецЕсли;
	Возврат СтрПакета[0]
КонецФункции

&НаКлиенте
Функция ДействиеПослеВыбораШтабеля(Результат, ДопПар) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		ЭтаФорма.Закрыть(Результат);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("НачатьВыводКвадратиковНаФормуПослеОткрытия",0.5, ИСТИНА);

//	ПриИзмененииПараметровЭкрана();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	Сообщить(""+АктивныйОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	а=1;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыводКвадратиковНаФормуПослеОткрытия()
	ОпределитьПараметрыРазмещенияЭлементовПриИзмененииПараметровЭкрана();
	НастроитьФорму(ИСТИНА);	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьПараметрыРазмещенияЭлементовПриИзмененииПараметровЭкрана()
	ДанныеЭкрана = ПолучитьИнформациюЭкрановКлиента();
	Если ДанныеЭкрана[0].Ширина > ДанныеЭкрана[0].Высота Тогда
		ГоризонтальноеПоложениеЭкрана = Истина;
		ЭлементовПоГоризонтали = 6;	
	Иначе
		ГоризонтальноеПоложениеЭкрана = Ложь;
		ЭлементовПоГоризонтали = 3;
	КонецЕсли;
	ШиринаЭкрана = ДанныеЭкрана[0].Ширина;
КонецПроцедуры
